Ran Plan for project: `cloud-cloudflare-dns` dir: `infrastructure/cloud/cloudflare/dns` workspace: `terragrunt`

<details><summary>Show Output</summary>

```diff
13:35:42.971 INFO   Downloading Terraform configurations from ../../.. into ./.terragrunt-cache/fqr4SQFuPtEjQVcTQUN9Ertv9AI/a-YDn_AYd-2NGFPdObH6KaLKgtw
13:35:43.290 STDOUT tofu: Initializing the backend...
13:35:43.473 STDOUT tofu: 
13:35:43.473 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
13:35:43.473 STDOUT tofu: use this backend unless the backend configuration changes.
13:35:43.558 STDOUT tofu: Initializing provider plugins...
13:35:43.558 STDOUT tofu: - Reusing previous version of backblaze/b2 from the dependency lock file
13:35:43.728 STDOUT tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
13:35:43.778 STDOUT tofu: - Reusing previous version of integrations/github from the dependency lock file
13:35:43.879 STDOUT tofu: - Reusing previous version of vexxhost/uptimerobot from the dependency lock file
13:35:43.964 STDOUT tofu: - Finding paultyng/unifi versions matching "~> 0.41"...
13:35:44.005 STDOUT tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
13:35:44.834 STDOUT tofu: - Installing cloudflare/cloudflare v4.42.0...
13:35:46.079 STDOUT tofu: - Installed cloudflare/cloudflare v4.42.0 (signed, key ID C76001609EE3B136)
13:35:47.200 STDOUT tofu: - Installing integrations/github v6.2.2...
13:35:48.305 STDOUT tofu: - Installed integrations/github v6.2.2 (signed, key ID 38027F80D7FD5FB2)
13:35:49.549 STDOUT tofu: - Installing vexxhost/uptimerobot v0.8.2...
13:35:50.481 STDOUT tofu: - Installed vexxhost/uptimerobot v0.8.2. Signature validation was skipped due to the registry not containing GPG keys for this provider
13:35:51.743 STDOUT tofu: - Installing paultyng/unifi v0.41.0...
13:35:52.665 STDOUT tofu: - Installed paultyng/unifi v0.41.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
13:35:53.918 STDOUT tofu: - Installing hashicorp/aws v5.67.0...
13:36:08.800 STDOUT tofu: - Installed hashicorp/aws v5.67.0 (signed, key ID 0C0AF313E5FD9F80)
13:36:10.031 STDOUT tofu: - Installing backblaze/b2 v0.8.12...
13:36:13.518 STDOUT tofu: - Installed backblaze/b2 v0.8.12. Signature validation was skipped due to the registry not containing GPG keys for this provider
13:36:13.519 STDOUT tofu: Providers are signed by their developers.
13:36:13.519 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
13:36:13.519 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
13:36:13.519 STDOUT tofu: OpenTofu has made some changes to the provider dependency selections recorded
13:36:13.519 STDOUT tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
13:36:13.519 STDOUT tofu: version control system if they represent changes you intended to make.
13:36:13.521 STDOUT tofu: OpenTofu has been successfully initialized!

13:36:28.719 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
13:36:28.719 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
13:36:28.719 STDOUT tofu:   + create
13:36:28.719 STDOUT tofu: OpenTofu will perform the following actions:
13:36:28.719 STDOUT tofu:   # cloudflare_record.internal_record["unifi_internal"] will be created
13:36:28.719 STDOUT tofu:   + resource "cloudflare_record" "internal_record" {
13:36:28.719 STDOUT tofu:       + allow_overwrite = false
13:36:28.719 STDOUT tofu:       + content         = (known after apply)
13:36:28.719 STDOUT tofu:       + created_on      = (known after apply)
13:36:28.720 STDOUT tofu:       + hostname        = (known after apply)
13:36:28.720 STDOUT tofu:       + id              = (known after apply)
13:36:28.720 STDOUT tofu:       + metadata        = (known after apply)
13:36:28.720 STDOUT tofu:       + modified_on     = (known after apply)
13:36:28.720 STDOUT tofu:       + name            = "unifi.internal"
13:36:28.720 STDOUT tofu:       + proxiable       = (known after apply)
13:36:28.720 STDOUT tofu:       + proxied         = false
13:36:28.720 STDOUT tofu:       + ttl             = 1
13:36:28.721 STDOUT tofu:       + type            = "A"
13:36:28.721 STDOUT tofu:       + value           = "192.168.1.1"
13:36:28.721 STDOUT tofu:       + zone_id         = (sensitive value)
13:36:28.721 STDOUT tofu:     }
13:36:28.721 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
13:36:28.721 STDOUT tofu: 
13:36:28.723 STDOUT tofu: ╷
13:36:28.723 STDOUT tofu: │ Warning: Argument is deprecated
13:36:28.723 STDOUT tofu: │ 
13:36:28.723 STDOUT tofu: │   with cloudflare_record.internal_record["loki_internal"],
13:36:28.723 STDOUT tofu: │   on 01-record.tf line 8, in resource "cloudflare_record" "internal_record":
13:36:28.723 STDOUT tofu: │    8:   value   = each.value["value"]
13:36:28.723 STDOUT tofu: │ 
13:36:28.723 STDOUT tofu: │ `value` is deprecated in favour of `content` and will be removed in the
13:36:28.723 STDOUT tofu: │ next major release.
13:36:28.723 STDOUT tofu: │ 
13:36:28.723 STDOUT tofu: │ (and 11 more similar warnings elsewhere)
13:36:28.724 STDOUT tofu: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cloud-cloudflare-dns
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.internal.siutsin.com/lock?id=siutsin%252Fotaru%252Finfrastructure%252Fcloud%252Fcloudflare%252Fdns%252Fterragrunt)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cloud-cloudflare-dns
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```